In [1]:
print 5

5

In [1]:
import pandas as pd

In [2]:
import sklearn as skl

In [3]:
import numpy as np

In [4]:
from matplotlib import pyplot as plt

In [5]:
import sys

In [7]:
print sys.executable

C:\Anaconda\python.exe

In [8]:
dates = pd.date_range('20130101',periods=6)

In [9]:
print dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2013-01-01  0.534915  0.157151 -0.563771 -0.783777
2013-01-02  0.309073  1.004204 -0.579137 -0.702057
2013-01-03  0.414668  1.161551 -0.051873  0.668754
2013-01-04 -0.677256 -1.232591  0.037169  0.824720
2013-01-05 -1.262925 -0.717154 -0.089373  0.166087
2013-01-06 -2.230490  1.549380 -1.426377 -1.653941

In [12]:
df = pd.DataFrame(np.random.randn(6,4),index=range(6),columns=list('ABCD'))

In [13]:
df

          A         B         C         D
0 -0.100834 -0.501483  1.644446  0.209976
1  0.842018  0.360122 -1.374059 -1.697183
2 -0.476870  1.010937 -0.518983  1.057046
3  0.691396 -1.160146  0.822387  1.010049
4  1.056506  0.044517  0.240344  0.574151
5 -0.324507  0.816012 -1.587261  0.596826

In [14]:
df = pd.DataFrame(np.random.randn(6,4),index=None,columns=list('ABCD'))

In [15]:
df

          A         B         C         D
0  1.046113  1.433533  0.330881 -0.243661
1 -0.626306  1.698267 -0.701605 -1.032417
2 -1.868904  1.762989 -0.328337  0.061213
3  1.573171 -0.298636 -0.401962  2.122854
4  0.033179 -1.861552 -0.707112  0.235678
5 -0.273939  1.762019  0.314045 -0.227814

# Аналог tabcut

Можно дропнуть из таблицы inplace, а можно скопировать в другой фрейм

In [16]:
# copy to another table

In [17]:
df1 = df[['A', 'C']]

In [18]:
df1

          A         C
0  1.046113  0.330881
1 -0.626306 -0.701605
2 -1.868904 -0.328337
3  1.573171 -0.401962
4  0.033179 -0.707112
5 -0.273939  0.314045

In [19]:
# either drop useless columns
df2 = df.drop(['D', 'B'], axis=1)

In [20]:
df2

          A         C
0  1.046113  0.330881
1 -0.626306 -0.701605
2 -1.868904 -0.328337
3  1.573171 -0.401962
4  0.033179 -0.707112
5 -0.273939  0.314045

Или можно прямо inplace

In [21]:
df.drop(['B', 'D'], axis=1, inplace=True)

In [22]:
df

          A         C
0  1.046113  0.330881
1 -0.626306 -0.701605
2 -1.868904 -0.328337
3  1.573171 -0.401962
4  0.033179 -0.707112
5 -0.273939  0.314045

# Аналог tab grep на одну колонку

простые варианты

In [24]:
df3 = df.loc[df['A'] > 0]

In [27]:
df3

          A         C
0  1.046113  0.330881
3  1.573171 -0.401962
4  0.033179 -0.707112

комбинирование условий

In [31]:
df4 = df.loc[df['A'] > 0.0 & df['C'] > 0]

TypeError: cannot compare a dtyped [float64] array with a scalar of type [bool]

In [32]:
df4 = df.loc[(df['A'] > 0.0) & (df['C'] > 0)]

In [33]:
df4

          A         C
0  1.046113  0.330881

Интересно, что без скобок не работает

проверка того, что можно более сложные сравнения писать

In [36]:
df5 = df.loc[(0.0 < df['A'] < 5.0) & (0 < df['C'] < 1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

Нельзя более сложные - надо через & или | комбинировать.

In [37]:
df5 = df.loc[((0.0 < df['A']) & (df['A'] < 5.0)) & ((0 < df['C']) & (df['C'] < 1))]

In [38]:
df5

          A         C
0  1.046113  0.330881

Проверка на наличие в списке

In [39]:
df_integers = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], None, list('abc'))

In [40]:
df_integers

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
df6 = df_integers.loc[df_integers['b'].isin([2, 8])][['a','c']]

In [42]:
df6

   a  c
0  1  3
2  7  9

Забавно, оно даже получается

# Сортировка - аналог tabsort

In [90]:
df_strings = pd.DataFrame([['a', 1, 'abx', 5.0],[1, 1, 'abx', 5], [2, 'b', 3, 6.0]], None, ['c1', 'c2', 'c3', 'c4'])

In [91]:
df_strings

  c1 c2   c3   c4
0  a  1  abx  5.0
1  1  1  abx  5.0
2  2  b    3  6.0

In [92]:
df_strings.columns

Index([u'c1', u'c2', u'c3', u'c4'], dtype='object')

In [93]:
df_strings.describe()

             c4
count  3.000000
mean   5.333333
std    0.577350
min    5.000000
25%    5.000000
50%    5.000000
75%    5.500000
max    6.000000

# сортировать можно по названию колонок и по номеру строки

In [94]:
df_strings.sort_index()

  c1 c2   c3   c4
0  a  1  abx  5.0
1  1  1  abx  5.0
2  2  b    3  6.0

In [95]:
df_strings.sort_index(ascending=True)

  c1 c2   c3   c4
0  a  1  abx  5.0
1  1  1  abx  5.0
2  2  b    3  6.0

In [96]:
df_strings.sort_index(ascending=False)

  c1 c2   c3   c4
2  2  b    3  6.0
1  1  1  abx  5.0
0  a  1  abx  5.0

In [97]:
df_strings.sort_index(ascending=False, axis=1)

    c4   c3 c2 c1
0  5.0  abx  1  a
1  5.0  abx  1  1
2  6.0    3  b  2

### Ну и собственно, по значению в колонке

In [98]:
df_strings.sort_values(by='c1')

  c1 c2   c3   c4
1  1  1  abx  5.0
2  2  b    3  6.0
0  a  1  abx  5.0

In [99]:
df_strings.sort_values(by='c4')

  c1 c2   c3   c4
0  a  1  abx  5.0
1  1  1  abx  5.0
2  2  b    3  6.0

In [100]:
df_strings.sort_values(by=['c4', 'c1'])

  c1 c2   c3   c4
1  1  1  abx  5.0
0  a  1  abx  5.0
2  2  b    3  6.0

# как посортировать с произвольным компаратором?

вообще предлагается сделать под это отдельную колонку нужного типа, и по ней отсортировать

In [121]:
from random import sample

In [122]:
x = 'abc'
y = str(x)*3 + '___'
''.join(sample(y, len(y)))

'accba_cb_b_a'

In [123]:
df_strings['c5'] = df_strings['c3'].apply(lambda x: ''.join(list(sample(str(x) * 3 + '___', len(str(x)) * 3 + 3))))

In [124]:
df_strings

  c1 c2   c3   c4            c5
0  a  1  abx  5.0  xab_x_bbaax_
1  1  1  abx  5.0  _b_abax_axbx
2  2  b    3  6.0        3__3_3

# Как отсортировать по одной колонке по убыванию, а по другой - по возрастанию?

ascending параметр умеет принимать список

In [125]:
df_strings.sort_values(by=['c4', 'c1'], ascending=[True, False])

  c1 c2   c3   c4            c5
0  a  1  abx  5.0  xab_x_bbaax_
1  1  1  abx  5.0  _b_abax_axbx
2  2  b    3  6.0        3__3_3

# Теперь переходим к джойну двух таблиц

In [6]:
df_left = pd.DataFrame([[1, 2, 3], [1,2,3], [4, 5, 6], [7, 8, 9]], None, ['a', 'b', 'c'])

In [17]:
df_left

   a  b  c
0  1  2  3
1  1  2  3
2  4  5  6
3  7  8  9

In [7]:
df_right = pd.DataFrame([[1, 2, 3], [1,2,3], [4, 5, 6], [7, 8, 9]], None, ['a', 'b', 'c'])

### для джойна предлагается использовать мето merge у объекта pd.DataFrame, или одноименную функцию из pandas. Метод просто предполагает, что левая таблица уже есть. Мне такой способ даже привычнее

In [8]:
df_left.merge(df_right, on='a')

   a  b_x  c_x  b_y  c_y
0  1    2    3    2    3
1  1    2    3    2    3
2  1    2    3    2    3
3  1    2    3    2    3
4  4    5    6    5    6
5  7    8    9    8    9

In [9]:
df_left.merge(df_right, on=['a', 'b'])

   a  b  c_x  c_y
0  1  2    3    3
1  1  2    3    3
2  1  2    3    3
3  1  2    3    3
4  4  5    6    6
5  7  8    9    9

In [10]:
df_left.merge(df_right, on=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  1  2  3
2  1  2  3
3  1  2  3
4  4  5  6
5  7  8  9

In [11]:
df_left.merge(df_right, on='b')

   a_x  b  c_x  a_y  c_y
0    1  2    3    1    3
1    1  2    3    1    3
2    1  2    3    1    3
3    1  2    3    1    3
4    4  5    6    4    6
5    7  8    9    7    9

### можно менять суффиксы, присываиваемые при конфликте

In [12]:
df_left.merge(df_right, on='a', suffixes=['', '_conflict'])

   a  b  c  b_conflict  c_conflict
0  1  2  3           2           3
1  1  2  3           2           3
2  1  2  3           2           3
3  1  2  3           2           3
4  4  5  6           5           6
5  7  8  9           8           9

### ух ты, крутота, есть встроенная валидация тпов джойна - можно проверить, что джойн имеет тип one_on_one

In [13]:
pd.merge(df_left, df_right, on='b', how='outer', validate="one_to_one")

TypeError: merge() got an unexpected keyword argument 'validate'

### лол, да, там дальше приписка, что доступно с версии 0.21.0, а у меня 0.20.3

еще можно посмотреть, откуда взялась запись в смердженной таблице, если добавить indicator=True

In [14]:
df_left.merge(df_right, on='a', suffixes=['', '_conflict'], indicator=True)

   a  b  c  b_conflict  c_conflict _merge
0  1  2  3           2           3   both
1  1  2  3           2           3   both
2  1  2  3           2           3   both
3  1  2  3           2           3   both
4  4  5  6           5           6   both
5  7  8  9           8           9   both

Можно даже имя колонки вместо буллева флага передать

In [15]:
df_left.merge(df_right, on='a', suffixes=['', '_conflict'], indicator='indicator_column')

   a  b  c  b_conflict  c_conflict indicator_column
0  1  2  3           2           3             both
1  1  2  3           2           3             both
2  1  2  3           2           3             both
3  1  2  3           2           3             both
4  4  5  6           5           6             both
5  7  8  9           8           9             both

Кажется, что на этом достаточно для первого времени. Дальше в тьюториале какая-то специфическая дичь начинается

# Аналог reduce

In [43]:
x = df_left.groupby(['a'], as_index=False).agg({'b': [np.sum, np.mean, np.std], 'c': ['first', 'std', 'last']})
print x.columns
print x.columns.values
x.columns = ['_'.join(y for y in col if y).strip() for col in x.columns.values]
print x
print x.columns

MultiIndex(levels=[[u'c', u'b', u'a'], [u'first', u'last', u'mean', u'std', u'sum', u'']],
           labels=[[2, 0, 0, 0, 1, 1, 1], [5, 0, 3, 1, 4, 2, 3]])
[('a', '') ('c', 'first') ('c', 'std') ('c', 'last') ('b', 'sum')
 ('b', 'mean') ('b', 'std')]
   a  c_first  c_std  c_last  b_sum  b_mean  b_std
0  1        3    0.0       3      4       2    0.0
1  4        6    NaN       6      5       5    NaN
2  7        9    NaN       9      8       8    NaN
Index([u'a', u'c_first', u'c_std', u'c_last', u'b_sum', u'b_mean', u'b_std'], dtype='object')

# Осталось научиться писать произвольный редьюсер

1) по произвольному ключу

In [50]:
from collections import OrderedDict

In [53]:
def f(lst):
    return 5 * sum(lst)

In [56]:
print df_left
x = df_left.groupby('a', as_index=False).agg(OrderedDict([('b', [np.sum, np.mean, np.std, f]), ('c', ['first', 'std', 'last'])]))

x.columns = ['_'.join(y for y in col if y).strip() for col in x.columns.values]
print x

   a  b  c
0  1  2  3
1  1  2  3
2  4  5  6
3  7  8  9
   a  b_sum  b_mean  b_std  b_f  c_first  c_std  c_last
0  1      4       2    0.0   20        3    0.0       3
1  4      5       5    NaN   25        6    NaN       6
2  7      8       8    NaN   40        9    NaN       9

# вроде все готово!

а, нет, еще не все - осталось научиться варить одну колонку из кучи других - применять произвольную функцию